# CheckBuildingConstructionClass Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..CheckBuildingConstructionClass Method
EnergyDataSettings Class See Also
---
Checks that the building construction class falls within an appropriate range.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool CheckBuildingConstructionClass(
	HVACLoadConstructionClass buildingConstructionClass
)
```

Visual Basic
---
```text
Public Shared Function CheckBuildingConstructionClass ( _
	buildingConstructionClass As HVACLoadConstructionClass _
) As Boolean
```

Visual C++
---
```text
public:
static bool CheckBuildingConstructionClass(
	HVACLoadConstructionClass buildingConstructionClass
)
```

# ### Parameters
buildingConstructionClass
    Type: Autodesk.Revit.DB.Analysis..::..HVACLoadConstructionClass The building construction class to be checked.
# ### Return Value
True if the building construction class falls within an appropriate range, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace